{
    "projects": [
        {
            "name" : "UPLY",
            "type" : "Mobile App",
            "tags" : [
                "Flutter",
                "Android Studio",
                "iCIMS API",
                "AR Core"
            ],
            "inspiration" : "We were looking for a fresh approach to job hunting and learning about opportunities while networking with sponsors at Hackathons.",
            "concept" : "\"UPLY\" (pronounced you-ply) uses AR-Core library and Flutter (a cross-platform framework bu Google) to render user profile and job openings using Augmented Reality. UPLY could be used to learn more about sponsors and have a meaningful conversation when you get an opportunity to talk to them.",
            "challenges" : "One of the most challenging thing we faced was integrating ArCore with Flutter and displaying augmented images on a screen. Another challenge was to work with the iCIMS API as it was not yet completely functional.",
            "learnt" : "ARCore functionalities, APIs, and advanced user interface with Flutter.",
            "next": "• Implement a dashboard for the sponsors so that they can also be prepared to talk to the students based on their portfolio. \n• Add predictive ML models to make better predictions about potential opportunities."
        },

        {
            "name" : "A* Visualizer",
            "type" : "Python project",
            "tags" : [
                "Python",
                "pygame",
                "A* algorithm",
                "AR Core"
            ],
            "inspiration" : "Being a visual learner, I wanted to visualize the popular A* PAthfinding Algorithm in order to better understand it.",
            "concept" : "A* is a graph traversal and path search algorithm, which is often used in many fields of computer science due to its completeness, optimality, and optimal efficiency. This project visualized that algorithm with the use of a maze-like game enviroment.",
            "challenges" : "",
            "learnt" : "Using the pygame library for making small scale game",
            "next": "• Translate this code into C# in Unity \n• Add more types of algorithms \n• Convert it into a 3D Experience."
        }
    ]
}